
開発目的
位置情報を共有することで待ち合わせ場所を明確にする
待ち合わせの情報共有（遅刻や待ち合わせ場所変更）をスムーズにする

要件定義
登録ページ
・集合場所、集合時間の設定
  ・場所の選択はgooglemapから選択
・集合ページのURLの発行

待受ページ（未到着ページ）
・目的地の更新
・目的地の更新チェック
・到着予定時刻報告ボタン
・現在位置共有（P2Pネットワークに最終存在位置を残す）

待受ページ（到着済みページ）
・他のユーザの位置情報確認
  ・最終存在位置を参照
・目的地を現在地に更新



タスク一覧

・フロントエンド（登録ページ：インプット）
  ・googlemapsから目的地座標取得
  ・イベント名や時刻の登録
  ・URLの表示
・フロントエンド（待受ページ：インプット）
  ・googlemapsから目的地座標取得
  ・遅刻しますボタン（電車・車・徒歩）
  ・その他デザイン
・フロントエンド（待受ページ：アウトプット）
  ・目的地変更の通知
・フロントエンド（待ち受け：裏処理）
  ・DBからイベントページの情報取得
  ・位置情報をDBに送信
  ・予定到着時間の送信（DB？RTC？）
・フロントエンド（到着ページ：インプット）
  ・目的地の変更
・フロントエンド（到着ページ：アウトプット）
  ・googlemapに各ユーザの位置を表示
  ・遅刻者の予定到着時間の表示
・フロントエンド（到着ページ：裏処理）
  ・各ユーザの位置情報＋予定時刻取得
  ・目的地の更新処理DB

・乗り換えAPI
・最寄駅API
・予想到着時間の算出

・映像作成
・プレゼン作成
